{
  "navbar": {
    "home": "Inicio",
    "about": "Sobre Mí",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "presentation": {
    "greeting": "Hola, soy",
    "description": "Soy un Desarrollador Web Front-End con 8 años de experiencia en el sector web y de videojuegos, especializado en desarrollo de sistemas. Me enfoco en escribir código limpio, escalable e intuitivo, facilitando la colaboración entre desarrolladores y garantizando un mantenimiento eficiente.",
    "downloadCV": "Descargar CV",
    "roles": ["Umberto Calogero", "Front-End Dev", "Creativo", "Jugador"]
  },
  "education": {
    "title": "Educación y habilidades",
    "subtitle": "Transforma tus habilidades en experiencias que marcan la diferencia",
    "items": [
      {
        "title": "2014 - 2018",
        "description": "Desarrollador Especializado en Sistemas para Videojuegos",
        "subtitle": "Diseño e implementación de arquitecturas software de alto rendimiento en C++ para sistemas de juego complejos. Desarrollo de módulos Python para interfaces de usuario avanzadas y gestión de bases de datos optimizadas MySQL/MariaDB para procesamiento de datos en tiempo real."
      },
      {
        "title": "2023 - Presente",
        "description": "Desarrollador Front-End & Arquitecto de Interfaces",
        "subtitle": "Ingeniería de aplicaciones web modernas con React, creando componentes reutilizables y optimizados. Desarrollo de soluciones responsive con HTML5 y CSS3, implementando mejores prácticas para rendimiento y accesibilidad."
      },
      {
        "title": "2024 - 2025",
        "description": "Máster en React",
        "subtitle": "Formación especializada en desarrollo de aplicaciones modernas con React, dominando la sintaxis JSX, arquitectura de componentes reutilizables y gestión avanzada de estados. Competencias en estilos con CSS Modules y Styled Components, gestión de formularios complejos con React Hook Form y routing avanzado con React Router. Preparación para desarrollo de aplicaciones enterprise-scale con mejores prácticas y patrones avanzados."
      },
      {
        "title": "2023 - 2025",
        "description": "Máster en Advanced Front-End Developer",
        "subtitle": "Especialización completa en el stack front-end moderno: HTML5 semántico, CSS3 avanzado con Grid/Flexbox, JavaScript ES6+ y desarrollo con React. Profundización en arquitecturas web escalables, metodologías de desarrollo cutting-edge y rendimiento. Formación práctica en patrones avanzados y mejores prácticas para desarrollo de interfaces enterprise-grade en Trazos - Escuela Superior de Arte Digital."
      },
      {
        "title": "2018 - 2023",
        "description": "Licenciatura en Lingüística Computacional y Comunicación Global",
        "subtitle": "Formación académica centrada en la intersección entre tecnología lingüística y desarrollo software, potenciando competencias en localización e internacionalización de aplicaciones digitales."
      }
    ]
  },
  "portfolio": {
    "discover": "Descubre más",
    "title": "Mis trabajos",
    "items": [
        {
            "title": "Diseño Web Front-End - Portfolio Creativo",
            "description": "Diseño y desarrollo de una página de inicio interactiva para un portfolio de videógrafos, con foco en UI/UX, diseño responsivo, tipografía refinada y animaciones sutiles. Implementación de secciones dinámicas para servicios, portfolio y contactos, optimizadas para rendimiento y accesibilidad."
        },
        {
            "title": "Desarrollo Web Front-End - Aplicación de Lista de Tareas",
            "description": "Desarrollo de una aplicación de lista de tareas moderna y responsiva, con gestión de tareas activas y completadas, interacciones intuitivas, modo claro/oscuro y diseño minimalista. Implementación de filtros, control del estado de las tareas y una interfaz fácil de usar para mejorar la productividad diaria."
        },
        {
            "title": "Arquitectura C++ - Motor y Rendimiento",
            "description": "Desarrollo de sistemas core optimizados para Metin2 con C++, enfocado en la gestión avanzada de memoria, optimización del rendimiento y resolución de fugas de memoria. Implementación de algoritmos eficientes para la gestión en tiempo real de miles de usuarios concurrentes."
        },
        {
            "title": "Python - Sistemas de Juego y Automatización",
            "description": "Diseño de frameworks modulares en Python para sistemas de juego dinámicos, automatización de procesos y desarrollo de herramientas internas. Creación de APIs híbridas Python-C++ para experiencias de usuario fluidas y personalizables."
        },
        {
            "title": "MySQL/MariaDB - Arquitectura de Base de Datos",
            "description": "Arquitectura de bases de datos escalables para la gestión de configuraciones de juego dinámicas y datos de juego en tiempo real. Implementación de procedimientos almacenados avanzados, consultas optimizadas y sistemas de copia de seguridad automatizados para alta disponibilidad."
        }
    ]
  },
  "contact": {
    "title": "Contáctame",
    "subtitle": "¡Trabajemos juntos! Siéntete libre de contactarme para colaboraciones o simplemente para saludar.",
    "name": "Tu Nombre",
    "email": "Tu Email",
    "message": "Tu Mensaje",
    "sendMessage": "ENVIAR MENSAJE",
    "sending": "ENVIANDO...",
    "messageSent": "✅ Mensaje enviado con éxito!",
    "messageError": "❌ Envío de mensaje fallido:",
    "fillAllFields": "Por favor completa todos los campos obligatorios.",
    "securityViolation": "Violación de seguridad detectada.",
    "location": "Madrid, España",
    "phone": "+34 647 14 08 18"
  },
  "footer": {
    "allRightsReserved": "Todos los derechos reservados.",
    "terms": "Términos y Condiciones",
    "privacy": "Política de Privacidad",
    "sitemap": "Mapa del Sitio"
  },
  "languages": {
    "italian": "Italiano",
    "spanish": "Español",
    "english": "Inglés",
    "portuguese": "Portugués"
  },
  "metin2Page": {
    "video": {
      "title": "",
      "subtitle": ""
    },
    "experience": {
      "title": "Experiencia Metin2",
      "items": [
        {
          "title": "C++ - Desarrollo de Motor & Optimización de Rendimiento",
          "description": "Desarrollo de sistemas C++ personalizados para servidores privados de Metin2, con enfoque en optimización de rendimiento y estabilidad del cliente. Resolución de memory leaks mediante debugging avanzado y análisis de memory footprint. Optimización de gestión de recursos del juego (texturas, mallas, audio) con lazy loading y estrategias de caching. Refactorización de código legacy para mejorar mantenibilidad y reducir crashes del cliente. Implementación de custom memory allocators y profiling tools para identificar cuellos de botella de rendimiento.",
          "image": "https://i.ibb.co/6cSfCN36/cpp-wallpaper.pnghttps://en-wiki.metin2.gameforge.com/images/1/1f/184header.jpg"
        },
        {
          "title": "Python - Arquitectura de Sistemas de Juego & Automatización",
          "description": "Desarrollo de interfaces híbridas Python-C++ para mejorar la experiencia de usuario e interacción del juego. Creación de sistemas de diálogo dinámicos y quest trackers integrados. Automatización de procesos de deployment y testing mediante scripts personalizados. Desarrollo de herramientas para creación de contenido y gestión de configuraciones. Implementación de event system modulares para contenidos estacionales.",
          "image": "https://i.ibb.co/QByxJrJ/python-wallpaper.png"
        },
        {
          "title": "MySQL/MariaDB - Arquitectura de Base de Datos & Escalabilidad",
          "description": "Arquitectura de base de datos escalable para gestión de configuraciones de juego dinámicas vía SQL. Implementación de sistemas de settings centralizados para reglas de gameplay, parámetros de balance y contenidos configurables. Desarrollo de stored procedures para hot-reloading de configuraciones sin downtime. Optimización de queries para acceso real-time a miles de parámetros configurables. Gestión de versioning de configuraciones y rollbacks automáticos.",
          "image": "https://i.ibb.co/whWcQ8zJ/navicat-wallpaper.png"
        }
      ]
    },
    "cards": {
      "title": "Otros Trabajos",
      "items": [
        {
          "title": "Lua - Sistema de Quest Personalizado & Lógica de Juego",
          "description": "Desarrollo de sistemas de quest avanzados en Lua para creación de misiones personalizadas y eventos dinámicos. Implementación de scripts para comportamiento de NPC, diálogos interactivos y mecánicas de juego únicas. Creación de frameworks modulares para desarrollo rápido de contenidos y sistemas de recompensas complejos.",
          "image": "https://en-wiki.metin2.gameforge.com/images/1/1f/184header.jpg"
        },
        {
          "title": "Librerías de Desarrollo & Calidad de Código",
          "description": "Creación de librerías internas y utilidades para optimizar el workflow de desarrollo. Escritura de código limpio y documentado para mejorar mantenibilidad y colaboración del equipo. Desarrollo de helper functions y wrappers para acelerar desarrollo de nuevas features.",
          "image": "https://en-wiki.metin2.gameforge.com/images/1/1f/184header.jpg"
        },
        {
          "title": "Paneles Automatizados de Gestión de Staff",
          "description": "Desarrollo de paneles administrativos automatizados para gestión eficiente del staff del juego. Implementación de herramientas de moderación real-time, sistemas de reportes automáticos y dashboards de monitorización. Creación de interfaces intuitivas para ban management, análisis de logs y soporte a jugadores. Automatización de tareas repetitivas para mejorar productividad y tiempos de respuesta.",
          "image": "https://en-wiki.metin2.gameforge.com/images/1/1f/184header.jpg"
        }
      ]
    },
    "conclusion": {
      "title": "Arquitecturas Escalables & Soluciones Personalizadas",
      "text": "Los proyectos presentados representan soluciones end-to-end desarrolladas para optimizar rendimiento, experiencia de usuario y gestión operativa de Metin2. Cada implementación fue diseñada pensando en escalabilidad, mantenibilidad y necesidades específicas de la comunidad. Estoy disponible para discutir cómo estas competencias pueden aplicarse a su proyecto, con enfoque en arquitecturas robustas y código de calidad enterprise-grade.",
      "button": "Volver a Trabajos"
    }
  },
  "frontPage": {
    "video": {
      "title": "",
      "subtitle": ""
    },
    "experience": {
      "title": "Experiencia Front-End",
      "items": [
        {
          "title": "React - Arquitectura Avanzada de Componentes y Gestión de Estado",
          "description": "Diseño y desarrollo de arquitecturas React escalables basadas en componentes reutilizables, con especial atención al rendimiento y la mantenibilidad. Implementación de patrones avanzados para la gestión del estado (Context API, Redux Toolkit, React Query) y optimización del renderizado mediante memoization y code-splitting. Integración con API REST y GraphQL para la gestión dinámica de datos y creación de interfaces reactivas y accesibles a nivel empresarial.",
          "image": "https://i.ibb.co/nGVx7Jd/photo-1633356122102-3fe601e05bd2.jpg"
        },
        {
          "title": "JavaScript - Lógica de Aplicación y Sistemas Interactivos",
          "description": "Desarrollo de lógicas de aplicación en JavaScript ES6+, con foco en arquitecturas modulares y asíncronas basadas en Promises y async/await. Implementación de patrones arquitectónicos como MVC para interfaces interactivas y dinámicas. Creación de módulos autónomos para la gestión de eventos, validación de datos, optimizando el rendimiento, la compatibilidad entre navegadores y la accesibilidad WCAG.",
          "image": "https://i.ibb.co/VpHF3Sm6/1-WSXKXYSzz-Ms-QYiiipk-H1-Aw.jpg"
        },
        {
          "title": "HTML/CSS - Arquitectura Semántica y Estilizado Avanzado de UI",
          "description": "Diseño de interfaces responsivas y semánticas con HTML5 y CSS3, basadas en un sistema de diseño modular. Uso avanzado de Flexbox, CSS Grid y variables CSS para la creación de layouts dinámicos y mantenibles. Implementación de animaciones fluidas con keyframes y transiciones, optimización del renderizado y respeto de las mejores prácticas para rendimiento, SEO y accesibilidad. Integración de preprocesadores y metodologías BEM/SASS para una estructura de código escalable y limpia.",
          "image": "https://i.ibb.co/PsztX6L2/Wr-VXNyz-Suyzh2-Kv-Lo-At-L-thumbnail.png"
        }
      ]
    },
    "cards": {
      "title": "Otros Trabajos",
      "items": [
        {
          "title": "Generador Avanzado de Contraseñas",
          "description": "Desarrollo de una herramienta avanzada para la generación segura de contraseñas, con opciones de personalización para longitud, complejidad y símbolos especiales. Implementación de criterios de seguridad actualizados y una interfaz fácil de usar para una protección óptima de los datos.",
          "image": "https://i.ibb.co/k2pdQcfZ/Sf-Kwd4-TOStae0qv3-IVbc-MA.png"
        },
        {
          "title": "Clon del Juego Wordle",
          "description": "Juego de palabras interactivo desarrollado con HTML, CSS y JavaScript, con una cuadrícula de 5x6 y teclado virtual, retroalimentación visual dinámica para letras correctas/posiciones correctas, gestión de estados de juego (victoria/derrota), optimizado para escritorio y móvil, código modular y mantenible, y una experiencia fluida y minimalista.",
          "image": "https://i.ibb.co/ynQ305qT/Wordle-preview.jpg"
        },
        {
          "title": "Componente de Tarjeta Social",
          "description": "Componente de UI modular para mostrar contenido social con avatares, publicaciones, comentarios e insignias personalizables. Optimizado para su reutilización en diferentes proyectos front-end, con un diseño responsivo y animaciones fluidas. Estructurado de forma modular para facilitar la integración y el mantenimiento, garantizando una experiencia de usuario coherente y moderna.",
          "image": "https://i.ibb.co/k6402LLX/lv-ZKQJKSR4-Wfi2z1b3-LXjg.png"
        }
      ]
    },
    "conclusion": {
      "title": "Arquitecturas Escalables y Soluciones Personalizadas",
      "text": "Los proyectos presentados constituyen una panorámica de mi trayectoria en el desarrollo front-end, con un enfoque en la arquitectura de interfaces, la optimización del rendimiento y la calidad del código. Cada implementación ha sido diseñada considerando la escalabilidad, la mantenibilidad y la accesibilidad, garantizando experiencias de usuario fluidas y coherentes en diferentes dispositivos. He adoptado metodologías modernas de desarrollo, patrones arquitectónicos consolidados y mejores prácticas de ingeniería para asegurar que las aplicaciones sean robustas, modulares y fácilmente extensibles. Este conjunto de experiencias refleja mi capacidad para afrontar desafíos complejos en el desarrollo web, equilibrando estética, funcionalidad y rendimiento técnico.",
      "button": "Volver a Trabajos"
    }
  }
}